frontend/views/admin/user-manage.php

use yii\grid\GridView;
use yii\helpers\Html;

$dataProvider = new ActiveDataProvider([
    'query' => User::find(),
    'pagination' => [
        'pageSize' => 5,
    ],
]);
---
SELECT * FROM `user` LIMIT 5 OFFSET 5
SELECT COUNT(*) FROM `user`