frontend/controllers/PostController.php

    public function actionDelete()
    {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Url::to(['/site/login']));
        }

        if (isset($_POST['id'])) {
            $id = $_POST['id'];
            Post::findOne(['id' => $id])->delete();
            Like::deleteAll(['post_id' => $id]);
            Comment::deleteAll(['post_id' => $id]);
            PostTag::deleteAll(['post_id' => $id]);
            PostNotification::deleteAll(['post_id' => $id]);
            PostProtected::deleteAll(['post_id' => $id]);
---
DELETE FROM `post` WHERE `id`=36
SELECT * FROM `post` WHERE `id`='36'
DELETE FROM `like` WHERE `post_id`='36'
DELETE FROM `comment` WHERE `post_id`='36'
DELETE FROM `post_tag` WHERE `post_id`='36'
DELETE FROM `post_notification` WHERE `post_id`='36'
DELETE FROM `post_protected` WHERE `post_id`='36'

    public function actionShowAll()
    {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Url::to(['/site/login']));
        }

        $query = Post::find()->where(['user_id' => Yii::$app->user->getId()]);

        $pagination = new Pagination([
            'defaultPageSize' => 4,
            'totalCount' => $query->count(),
        ]);

        $list_post = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->asArray()
            ->all();
---
SELECT COUNT(*) FROM `post` WHERE `user_id`=11
SELECT * FROM `post` WHERE `user_id`=11 ORDER BY `id` LIMIT 4

    public function actionLike()
    {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Url::to(['/site/login']));
        }

        if (isset($_POST['id'])) {
            $id = $_POST['id'];
            Like::addLike($id, Yii::$app->user->getId());

            $receiver = Post::findOne(['id' => $id])['user_id'];
---
SELECT * FROM `post` WHERE `id`='36'

    public function actionUnlike()
    {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Url::to(['/site/login']));
        }

        if (isset($_POST['id'])) {
            Like::deleteAll(['user_id' => Yii::$app->user->getId(), 'post_id' => $_POST['id']]);

            PostNotification::deleteAll(['post_id' => $_POST['id'], 'type' => 0, 'action_id' => Yii::$app->user->getId()]);
---
DELETE FROM `like` WHERE (`user_id`=11) AND (`post_id`='34')
DELETE FROM `post_notification` WHERE (`post_id`='34') AND (`type`=0) AND (`action_id`=11)