frontend/controllers/UserController.php

SELECT * FROM `user` WHERE `username`='John1'
---
    public function actionFindUsername()
    {
        if (isset($_POST['username'])) {
            $username = $_POST['username'];
        } else {
            $username = "";
        }

        $model = User::find()->where(['username' => $username])->asArray()->all();

SELECT * FROM `user` WHERE `id`=11
---
    public function actionEditUserProfile()
    {
        $user = User::findOne(['id' => \Yii::$app->user->getId()]);

SELECT * FROM `user` WHERE `id`='2'
---
    public function actionShowUserProfile($id)
    {
        $user = User::findOne(['id' => $id]);