common/models/Like.php

INSERT INTO `like` (`user_id`, `post_id`) VALUES (11, 36)
---
    public static function addLike($post_id, $user_id)
    {
        $like = new Like();
        $like['user_id'] = $user_id;
        $like['post_id'] = $post_id;
        $like->save();