frontend/views/layouts/left.php

SELECT * FROM `user` WHERE `id`=11
---
<?php
use yii\helpers\Url;
$model = \common\models\User::findOne(['id' => Yii::$app->user->getId()]);