frontend/views/layouts/main.php

SELECT * FROM `user` WHERE `id`=11
---
    </head>

    <?php
    $user = \common\models\User::findOne(['id' => Yii::$app->user->getId()]);