frontend/models/PostCreateForm.php

    public function createPost()
    {
        $newPost = new Post();
        $newPost['title'] = $this->title;
        $newPost['content'] = $this->content;
        $newPost['permit'] = $this->permit[0];
        if($this->upload()){
            $newPost['image'] = $this->thumbnail;
        }
        if ($this->date == "") {
            $newPost['create_at'] = date("Y-m-d");
        } else {
            $newPost['create_at'] = $this->date;
        }
        $newPost['user_id'] = $this->user_id;
        $newPost->save();
---
INSERT INTO `post` (`title`, `content`, `permit`, `image`, `create_at`, `user_id`) VALUES ('Today Is an awesome day', '<p>dfddfdfsds</p>\r\n', 1, '4912eb00a1043cdebdd33e22889d7f10.jpg', '2021-03-20', 11)