frontend/views/post/detail.php


$this->title = 'Detail post';
$this->params['breadcrumbs'][] = $this->title;
$listCmt = \common\models\Comment::find()->where(['post_id' => $model['id']])->asArray()->all();
$likeCount = \common\models\Like::find()->where(['post_id' => $model['id']])->count();
$isLiked = \common\models\Like::findOne(['post_id' => $model['id'], 'user_id' => Yii::$app->user->getId()]) != null;
---
SELECT * FROM `comment` WHERE `post_id`=34
SELECT COUNT(*) FROM `like` WHERE `post_id`=34
SELECT * FROM `like` WHERE (`post_id`=34) AND (`user_id`=11)

            <div class="box-footer">

                    <img class="img-responsive img-circle img-sm" src="<?php
                    $cmtPerson = \common\models\User::findOne(['id' => Yii::$app->user->getId()]);
---
SELECT * FROM `user` WHERE `id`=11