frontend/views/post/item.php

SELECT COUNT(*) FROM `comment` WHERE `post_id`='34'
SELECT COUNT(*) FROM `like` WHERE `post_id`='34'
SELECT * FROM `like` WHERE (`post_id`='34') AND (`user_id`=11)
---

use yii\helpers\Url;

$cmtCount = \common\models\Comment::find()->where(['post_id' => $model['id']])->count();
$likeCount = \common\models\Like::find()->where(['post_id' => $model['id']])->count();

$isLiked = \common\models\Like::findOne(['post_id' => $model['id'], 'user_id' => Yii::$app->user->getId()]) != null;