frontend/views/user/friend-timeline.php

$this->title = 'Sight seeing';
$this->params['breadcrumbs'][] = $this->title;

$listPost = \common\models\Post::find()->where(['user_id' => $model['id']])->asArray()->all();
---
SELECT * FROM `post` WHERE `user_id`=2

        }
    }
}
$friendCount = \common\models\Relationship::find()->where(['user_id_1' => $model['id'], 'status' => 1])->count()
    + \common\models\Relationship::find()->where(['user_id_2' => $model['id'], 'status' => 1])->count();
---
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_1`=2) AND (`status`=1)
SELECT COUNT(*) FROM `relationship` WHERE (`user_id_2`=2) AND (`status`=1)

                    $user_id_1 = $user_id_2;
                    $user_id_2 = $tg;
                }
                $isFriend = \common\models\Relationship::findOne(['user_id_1' => $user_id_1, 'user_id_2' => $user_id_2, 'status' => 1]) != null;
---
SELECT * FROM `relationship` WHERE (`user_id_1`=2) AND (`user_id_2`=11) AND (`status`=0)