frontend/views/user/user-profile.php

 */
$this->title = 'Profile Page';
$this->params['breadcrumbs'][] = $this->title;
$user = \common\models\User::findOne(['id' => Yii::$app->user->getId()]);
---
SELECT * FROM `user` WHERE `id`=11