frontend/views/site/index.php

SELECT * FROM `post` WHERE `create_at`='2021-03-19'
---
$this->title = "Posts of the day";
$this->params['breadcrumbs'][] = $this->title;

$listPost = \common\models\Post::find()->where(['create_at' => date('Y-m-d')])->asArray()->all();

SELECT * FROM `user` WHERE `id`='8'
---

    <?php
    foreach ($listPost as $post) {
        $user = \common\models\User::findOne(['id' => $post['user_id']]);